In [3]:
import numpy as np
import pandas as pd
from pandas import DataFrame
df = DataFrame(
              [
                ['Aryan','Singh','Full-time','administration',2,2000],
                ['Rohan','Agarval','intern','technical',3,5000],
                ['Riya','Shah','Full-time','administration',5,10000],
                ['Yash','Bhatia','Part-time','technical',7,10000],
                ['Siddant','Khanna','Full-time','Management',6,20000],
              ]
            , columns=['FIRST NAME','LAST NAME','TYPE','DEPARTMENT','YOE','SALARY']
              )
df

  FIRST NAME LAST NAME       TYPE      DEPARTMENT  YOE  SALARY
0      Aryan     Singh  Full-time  administration    2    2000
1      Rohan   Agarval     intern       technical    3    5000
2       Riya      Shah  Full-time  administration    5   10000
3       Yash    Bhatia  Part-time       technical    7   10000
4    Siddant    Khanna  Full-time      Management    6   20000

1. Make a pivot table which shows average salary of each type of employee for each 
department.

In [4]:
table =pd.pivot_table(df,index ='TYPE',columns='DEPARTMENT',values='SALARY',aggfunc='sum')
table

DEPARTMENT  Management  administration  technical
TYPE
Full-time      20000.0         12000.0        NaN
Part-time          NaN             NaN    10000.0
intern             NaN             NaN     5000.0

2. Make a pivot table which shows the sum and mean of the salaries of each type of 
employee and the number of employees of each type.

In [5]:
table =pd.pivot_table(df,index ='TYPE',values='SALARY',aggfunc=['sum','mean','count'])
table

             sum          mean  count
          SALARY        SALARY SALARY
TYPE
Full-time  32000  10666.666667      3
Part-time  10000  10000.000000      1
intern      5000   5000.000000      1